{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "filters": 75, "batch_input_shape": [null, 28, 28, 1], "use_bias": true, "activation": "relu", "name": "conv2d_1", "kernel_regularizer": null, "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "dtype": "float32", "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5]}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_1", "trainable": true, "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.2, "trainable": true, "name": "dropout_1", "seed": null}}, {"class_name": "Conv2D", "config": {"filters": 100, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": true, "activation": "relu", "name": "conv2d_2", "kernel_regularizer": null, "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5]}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_2", "trainable": true, "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.2, "trainable": true, "name": "dropout_2", "seed": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "relu", "name": "dense_1", "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "units": 500, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.5, "trainable": true, "name": "dropout_3", "seed": null}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "softmax", "name": "dense_2", "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "units": 10, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "backend": "tensorflow", "keras_version": "2.1.1"}