{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "use_bias": true, "data_format": "channels_last", "padding": "valid", "kernel_regularizer": null, "dtype": "float32", "name": "conv2d_1", "activation": "relu", "trainable": true, "bias_regularizer": null, "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "filters": 75, "batch_input_shape": [null, 50, 70, 1], "kernel_size": [5, 5], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "kernel_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_1", "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.2, "seed": null, "name": "dropout_1", "trainable": true, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "use_bias": true, "data_format": "channels_last", "padding": "valid", "kernel_regularizer": null, "name": "conv2d_2", "activation": "relu", "trainable": true, "bias_regularizer": null, "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "filters": 100, "kernel_size": [5, 5], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "kernel_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_2", "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.2, "seed": null, "name": "dropout_2", "trainable": true, "noise_shape": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_regularizer": null, "units": 500, "name": "dense_1", "activation": "relu", "trainable": true, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"rate": 0.5, "seed": null, "name": "dropout_3", "trainable": true, "noise_shape": null}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_regularizer": null, "units": 21, "name": "dense_2", "activation": "relu", "trainable": true, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "softmax"}}], "backend": "tensorflow", "keras_version": "2.1.0"}