{"keras_version": "2.1.0", "config": [{"config": {"trainable": true, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 75, "batch_input_shape": [null, 50, 70, 1], "padding": "valid", "name": "conv2d_1", "strides": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "relu", "use_bias": true, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [5, 5], "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_1", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "seed": null, "noise_shape": null, "name": "dropout_1", "rate": 0.2}, "class_name": "Dropout"}, {"config": {"trainable": true, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 100, "padding": "valid", "name": "conv2d_2", "strides": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "relu", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [5, 5], "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_2", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "seed": null, "noise_shape": null, "name": "dropout_2", "rate": 0.2}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 500, "name": "dense_1", "activation": "relu", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "seed": null, "noise_shape": null, "name": "dropout_3", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 21, "name": "dense_2", "activation": "relu", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "softmax"}, "class_name": "Activation"}], "backend": "tensorflow", "class_name": "Sequential"}