{"class_name": "Sequential", "keras_version": "2.1.0", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "activation": "relu", "kernel_size": [5, 5], "filters": 75, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_1", "dtype": "float32", "padding": "valid", "data_format": "channels_last", "batch_input_shape": [null, 70, 50, 1], "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_1", "noise_shape": null, "trainable": true, "rate": 0.2}}, {"class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "activation": "relu", "kernel_size": [5, 5], "filters": 100, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_2", "padding": "valid", "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_2", "noise_shape": null, "trainable": true, "rate": 0.2}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "use_bias": true, "activation": "relu", "units": 500, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "name": "dense_1", "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_3", "noise_shape": null, "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"trainable": true, "use_bias": true, "activation": "relu", "units": 21, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "name": "dense_2", "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "softmax"}}]}