{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"kernel_size": [5, 5], "padding": "valid", "trainable": true, "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_1", "dtype": "float32", "activation": "relu", "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 75, "use_bias": true, "batch_input_shape": [null, 70, 50, 1]}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_1", "strides": [2, 2], "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "rate": 0.2, "name": "dropout_1", "seed": null}}, {"class_name": "Conv2D", "config": {"kernel_size": [5, 5], "activity_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "padding": "valid", "bias_regularizer": null, "name": "conv2d_2", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 100, "use_bias": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_2", "strides": [2, 2], "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "rate": 0.2, "name": "dropout_2", "seed": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "dense_1", "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "units": 500, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "rate": 0.5, "name": "dropout_3", "seed": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "dense_2", "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "units": 22, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activation": "relu"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "softmax"}}], "keras_version": "2.1.0", "backend": "tensorflow"}