{"keras_version": "2.1.0", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"dtype": "float32", "data_format": "channels_last", "padding": "valid", "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "relu", "name": "conv2d_1", "trainable": true, "batch_input_shape": [null, 70, 50, 1], "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_size": [5, 5], "filters": 75, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "trainable": true, "padding": "valid", "name": "max_pooling2d_1", "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.2, "seed": null, "noise_shape": null, "trainable": true}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "padding": "valid", "data_format": "channels_last", "bias_regularizer": null, "activation": "relu", "name": "conv2d_2", "trainable": true, "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_size": [5, 5], "filters": 100, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "trainable": true, "padding": "valid", "name": "max_pooling2d_2", "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "rate": 0.2, "seed": null, "noise_shape": null, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "name": "dense_1", "units": 500, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "rate": 0.5, "seed": null, "noise_shape": null, "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "name": "dense_2", "units": 21, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "softmax", "trainable": true}}]}